# Ultralytics YOLO 🚀, AGPL-3.0 license

nc: 80
scales:
  m: [0.50, 1.00, 512]

backbone:
  - [-1, 1, HGStem, [16, 32]]  # 0-P2/4

  - [0, 2, C3k2, [32, False, 0.25]] # 1-P2/4(backbone1)
  - [0, 3, HGBlock, [16, 32, 3]] # 2-P2/4(backbone2)
  - [[1, 2], 1, DynamicAlignFusion, [32]] # 3-P2/4

  - [-1, 1, Conv, [64, 3, 2]] # 4-P3/8(backbone1)
  - [-1, 2, C3k2, [64, False, 0.25]] # 5-P3/8(backbone1)
  - [3, 1, DWConv, [64, 3, 2, 1, False]]  # 6-P3/8(backbone2)
  - [-1, 3, HGBlock, [32, 64, 3]]   # 7-P3/8(backbone2)
  - [[5, 7], 1, DynamicAlignFusion, [64]] # 8-P3/8

  - [-1, 1, Conv, [128, 3, 2]]  # 9-P4/16(backbone1)
  - [-1, 2, C3k2, [128, True]] # 10-P4/16(backbone1)
  - [8, 1, DWConv, [128, 3, 2, 1, False]]  # 11-P4/16(backbone2)
  - [-1, 3, HGBlock, [64, 128, 5, True, False]]  # 12-P4/16(backbone2)
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]  # 13-P4/16(backbone2)
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]  # 14-P4/16(backbone2)
  - [[10, 14], 1, DynamicAlignFusion, [128]] # 15-P4/16

  - [15, 1, Conv, [256, 3, 2]]  # 16-P5/32(backbone1)
  - [-1, 2, C3k2, [256, True]] # 17-P5/32(backbone1)
  - [15, 1, DWConv, [256, 3, 2, 1, False]]  # 18-P5/32(backbone2)
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]  # 19-P5/32(backbone2)
  - [[17, 19], 1, DynamicAlignFusion, [256]] # 20-P5/32

  - [-1, 1, SPPF, [1024, 5]] # 21-P5/32
  - [-1, 1, C2PSA, [1024]] # 22-P5/32

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 25

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 28 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 31 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 28], 1, Concat, [1]] # cat head P2
  - [-1, 2, C3k2, [512, False]] # 34 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 25], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 37 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 22], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 40 (P5/32-large)

  - [[31, 34, 37, 40], 1, Detect_LSDECD, [nc, 256]] # Detect(P3, P4, P5)